# tap
tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "cjbassi/ytop"
tap "filosottile/musl-cross"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "versent/taps"
tap "warrensbox/tap"

# brew
brew "ansible"
brew "aws-iam-authenticator"
brew "python@3.10"
brew "awscli"
brew "awslogs"
brew "bat"
brew "chezmoi"
brew "cmake"
brew "deno"
brew "git-delta"
brew "gping"
brew "docker-compose", link: false
brew "exa"
brew "expat"
brew "fd"
brew "fzf"
brew "gmp"
brew "ghcup"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gh"
brew "gibo"
brew "git-secrets"
brew "gitui"
brew "glib"
brew "gnu-sed"
brew "pkg-config"
brew "guile"
brew "unbound"
brew "go"
brew "grpcurl"
brew "elixir"
brew "helm"
brew "hexyl"
brew "htop"
brew "hyperfine"
brew "icarus-verilog"
brew "jenv"
brew "jq"
brew "java"
brew "kompose"
brew "krb5"
brew "kubernetes-cli"
brew "kustomize"
brew "kubectx"
brew "k9s"
brew "lcov"
brew "jesseduffield/lazygit/lazygit"
brew "lazydocker"
brew "ldns"
brew "libfido2"
brew "libomp"
brew "libressl"
brew "libslirp"
brew "libssh"
brew "lima"
brew "llvm"
brew "llvm@11"
brew "lolcat"
brew "make"
brew "maven"
brew "nghttp2"
brew "ninja"
brew "node"
brew "neofetch"
brew "neovim"
brew "openssh"
brew "openssl@3"
brew "openjdk@17"
brew "openjdk@11"
brew "openjdk@8"
brew "packer"
brew "peco"
brew "qemu"
brew "procs"
brew "pyenv"
brew "poetry"
brew "protobuf"
brew "ripgrep"
brew "starship"
brew "sl"
brew "terminal-notifier"
brew "terraform", link: false
brew "terraformer"
brew "terraforming"
brew "tmux"
brew "tmuxinator"
brew "zig"
brew "zlib"
brew "cjbassi/ytop/ytop"
brew "filosottile/musl-cross/musl-cross"
brew "warrensbox/tap/tfswitch"

# cask
cask "1password"
cask "alfred"
cask "aws-vault"
cask "bloomrpc"
cask "caffeine"
cask "chromedriver"
cask "chromium"
cask "docker"
cask "firefox"
cask "fig"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hot"
cask "lens"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "mic-drop"
cask "ngrok"
cask "nordvpn"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "wezterm"
cask "xquartz"
