# tap
tap "aws/tap"
tap "filosottile/musl-cross"
tap "FelixKratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "versent/taps"

# brew
brew "asciinema"
brew "aws-iam-authenticator"
brew "awscli"
brew "bat"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "coursier"
brew "deno"
brew "git-delta"
brew "gping"
brew "eza"
brew "expat"
brew "fd"
brew "fzf"
brew "gmp"
brew "ghcup"
brew "mpfr"
brew "gawk"
brew "isl"
brew "libmpc"
brew "gcc"
brew "gh"
brew "ghq"
brew "gibo"
brew "git-secrets"
brew "glib"
brew "gnu-sed"
brew "pkg-config"
brew "guile"
brew "goreleaser/tap/goreleaser"
brew "unbound"
brew "grpcurl"
brew "elixir"
brew "helm"
brew "hexyl"
brew "htop"
brew "hyperfine"
brew "icarus-verilog"
brew "jq"
brew "kompose"
brew "krb5"
brew "kubernetes-cli"
brew "kustomize"
brew "kubectx"
brew "k9s"
brew "lcov"
brew "jesseduffield/lazygit/lazygit"
brew "JetBrains/utils/kotlin-lsp"
brew "lazydocker"
brew "ldns"
brew "libfido2"
brew "libomp"
brew "libressl"
brew "libslirp"
brew "libssh"
brew "lima"
brew "llvm"
brew "lolcat"
brew "make"
brew "marp-cli"
brew "maven"
brew "mise"
brew "nghttp2"
brew "ninja"
brew "neovim"
brew "macchina"
brew "openssh"
brew "openssl@3"
brew "peco"
brew "qemu"
brew "procs"
brew "poetry"
brew "protobuf"
brew "ripgrep"
brew "sketchybar"
brew "starship"
brew "sheldon"
brew "sl"
brew "terminal-notifier"
brew "terraformer"
brew "tmux"
brew "tpm"
brew "tmuxinator"
brew "xh"
brew "yazi"
brew "zig"
brew "zlib"
brew "filosottile/musl-cross/musl-cross"
brew "zellij"

# cask
cask "alt-tab"
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "aws-vault"
cask "bloomrpc"
cask "caffeine"
cask "chromium"
cask "claude-code"
cask "codex"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-udev-gothic-nf"
cask "google-chrome"
cask "google-japanese-ime"
cask "hot"
cask "lens"
cask "karabiner-elements"
cask "keycastr"
cask "mic-drop"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "slack"
cask "tableplus"
cask "ubersicht"
cask "visual-studio-code"
cask "wezterm"
cask "xquartz"
cask "zed"
