# tap
tap "FelixKratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "JetBrains/utils"
tap "filosottile/musl-cross"

# brew — macOS-specific, GUI-adjacent, or heavy system toolchain/libraries.
# CLI tools managed by devbox are not listed here.
brew "borders"
brew "sketchybar"
brew "JetBrains/utils/kotlin-lsp"
brew "terminal-notifier"

# System C/C++ toolchain and libraries
brew "cmake"
brew "expat"
brew "gcc"
brew "glib"
brew "gmp"
brew "guile"
brew "isl"
brew "krb5"
brew "lcov"
brew "ldns"
brew "libfido2"
brew "libmpc"
brew "libomp"
brew "libressl"
brew "libslirp"
brew "libssh"
brew "llvm"
brew "make"
brew "maven"
brew "mpfr"
brew "nghttp2"
brew "ninja"
brew "openssh"
brew "openssl@3"
brew "pkg-config"
brew "qemu"
brew "unbound"
brew "zlib"
brew "filosottile/musl-cross/musl-cross"

# Elixir (kept on Homebrew for simplicity)
brew "elixir"

# tmux plugin manager
brew "tpm"

# cask
cask "alt-tab"
cask "1password"
cask "nikitabobko/tap/aerospace"
cask "aws-vault"
cask "bloomrpc"
cask "caffeine"
cask "chromium"
cask "claude-code"
cask "codex"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-udev-gothic-nf"
cask "google-chrome"
cask "google-japanese-ime"
cask "hot"
cask "lens"
cask "karabiner-elements"
cask "keycastr"
cask "mic-drop"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "slack"
cask "tableplus"
cask "ubersicht"
cask "visual-studio-code"
cask "wezterm"
cask "xquartz"
cask "zed"
